webapp/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:preh="http://prehmis-qa.capetown.gov.za/">
    <soapenv:Header>
        <preh:AuthHeaderElement>
            <username>idart</username>
            <password>idart</password>
            <facility_code>WES</facility_code>
            <application_key>idart</application_key>
        </preh:AuthHeaderElement>
    </soapenv:Header>
    <soapenv:Body>
        <preh:getPatient>
            <AuthHeader/>
            <nr>72254311</nr>
            <identifier>PGWC</identifier>
        </preh:getPatient>
    </soapenv:Body>
</soapenv:Envelope>